apache/nuttx/arch/mips/src/pic32mz/pic32mz_ethernet.c
  /* Clear the Ethernet STAT BUFCNT */

  while ((pic32mz_getreg(PIC32MZ_ETH_STAT) & ETH_STAT_BUFCNT_MASK) != 0)
    {
      pic32mz_putreg(ETH_CON1_BUFCDEC, PIC32MZ_ETH_CON1SET);
    }

  /* Clear the Ethernet Interrupt Flag (ETHIF) bit in the Interrupts module */

#if CONFIG_PIC32MZ_NINTERFACES > 1
  mips_pending_irq(priv->pd_irqsrc);
#else
  mips_pending_irq(PIC32MZ_IRQ_ETH);
#endif

  /* Disable any Ethernet Controller interrupt generation by clearing the IEN
   * register.
   */

  pic32mz_putreg(ETH_INT_ALLINTS, PIC32MZ_ETH_IENCLR);

  /* Clear the TX and RX start addresses by using ETHTXSTCLR and ETHRXSTCLR */

  pic32mz_putreg(0xffffffff, PIC32MZ_ETH_TXSTCLR);
  pic32mz_putreg(0xffffffff, PIC32MZ_ETH_RXSTCLR);

  /* MAC Initialization *****************************************************/

  /* Put the MAC into the reset state */

  pic32mz_putreg((EMAC1_CFG1_TXRST  | EMAC1_CFG1_MCSTXRST |
                  EMAC1_CFG1_RXRST  | EMAC1_CFG1_MCSRXRST |
                  EMAC1_CFG1_SIMRST | EMAC1_CFG1_SOFTRST),
                  PIC32MZ_EMAC1_CFG1);

  /* Take the MAC out of the reset state */

  up_udelay(50);
  pic32mz_putreg(0, PIC32MZ_EMAC1_CFG1);
  leave_critical_section(flags);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: pic32mz_ethinitialize
 *
 * Description:
 *   Initialize one Ethernet controller and driver structure.
 *
 * Input Parameters:
 *   intf - Selects the interface to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

#if CONFIG_PIC32MZ_NINTERFACES > 1 || defined(CONFIG_NETDEV_LATEINIT)
int pic32mz_ethinitialize(int intf)
#else
static inline int pic32mz_ethinitialize(int intf)
#endif
{
  struct pic32mz_driver_s *priv;
  int ret;

  DEBUGASSERT(intf < CONFIG_PIC32MZ_NINTERFACES);
  priv = &g_ethdrvr[intf];

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct pic32mz_driver_s));
  priv->pd_dev.d_ifup    = pic32mz_ifup;    /* I/F down callback */
  priv->pd_dev.d_ifdown  = pic32mz_ifdown;  /* I/F up (new IP address) callback */
  priv->pd_dev.d_txavail = pic32mz_txavail; /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
  priv->pd_dev.d_addmac  = pic32mz_addmac;  /* Add multicast MAC address */
  priv->pd_dev.d_rmmac   = pic32mz_rmmac;   /* Remove multicast MAC address */
#endif
  priv->pd_dev.d_private = priv;            /* Used to recover private state from dev */

#if CONFIG_PIC32MZ_NINTERFACES > 1
#  error "A mechanism to associate base address an IRQ with an interface is needed"
  priv->pd_base          = ;                /* Ethernet controller base address */
  priv->pd_irq           = ;                /* Ethernet controller IRQ vector number */
  priv->pd_irqsrc        = ;                /* Ethernet controller IRQ source number */
#endif

  /* Configure Ethernet peripheral pin selections */

  /* Controlled by DEVCFG FMIIEN and FETHIO settings */

  /* Reset the Ethernet controller and leave in the ifdown state.  The
   * Ethernet controller will be properly re-initialized each time
   * pic32mz_ifup() is called.
   */

  pic32mz_ifdown(&priv->pd_dev);

  /* Attach the IRQ to the driver */

#if CONFIG_PIC32MZ_NINTERFACES > 1
  ret = irq_attach(priv->pd_irq, pic32mz_interrupt, NULL);
#else
  ret = irq_attach(PIC32MZ_IRQ_ETH, pic32mz_interrupt, NULL);
#endif
  if (ret != 0)
    {
      /* We could not attach the ISR to the interrupt */

      return -EAGAIN;
    }

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->pd_dev, NET_LL_ETHERNET);
  return OK;
}

/****************************************************************************
 * Name: mips_netinitialize
 *
 * Description:
 *   Initialize the first network interface.  If there are more than one
 *   interface in the chip, then board-specific logic will have to provide
 *   this function to determine which, if any, Ethernet controllers should
 *   be initialized.
 *
 ****************************************************************************/

#if CONFIG_PIC32MZ_NINTERFACES == 1 && !defined(CONFIG_NETDEV_LATEINIT)
void mips_netinitialize(void)
{
  pic32mz_ethinitialize(0);
}
#endif
#endif /* CHIP_NETHERNET > 0 */
#endif /* CONFIG_NET && CONFIG_PIC32MZ_ETHERNET */
